<a href="https://colab.research.google.com/github/cybermin/pythonbasic/blob/master/04/pandas02_dataframe2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 판다스(pandas)
+ 파이썬에서 사용하는 데이터분석 라이브러리

+ 행과 열로 이루어진 데이터 객체를 만들어 다룰 수 있게 되며 보다 안정적으로 대용량의 데이터들을 처리하는데 매우 편리한 도구

+ NumPy를 기반으로 구축되었으며 과학 컴퓨팅 환경 내에서 다른 많은 타사 라이브러리와 잘 통합되도록 설계

In [80]:
import pandas as pd


##DataFrame
+ 2차원 자료구조인 DataFrame는 행과 열이 있는 테이블 데이터
+ 딕션너리를 데이터 프레임으로 변경
 - 딕션너리 키 : 열(column)
 - 딕션너리 값 : 행(row)

In [81]:
df = pd.read_csv('/content/drive/My Drive/PythonWork/PythonBasic/04/부산쓰레기발생2017년.csv', engine='python', encoding='CP949')
df

        항목    구분     중구     서구     동구   ...   강서구    연제구    수영구    사상구    기장군
0    매립처리량  연간(톤)   3034   2323   1653  ...   9742   1831   2205   9937   2290
1    매립처리량  일일(톤)      8      7      5  ...     27      5      6     27      6
2    소각처리량  연간(톤)  13729  10446   8297  ...   4788  14521  11987    216  13687
3    소각처리량  일일(톤)     38     29     23  ...     13     40     33      0     37
4   재활용처리량  연간(톤)   9082  21301  17968  ...  25977  37115  28135  57110  15170
5   재활용처리량  일일(톤)     25     58     49  ...     71    102     77    156     42
6  음식물류발생량  연간(톤)   5154   8779   6399  ...  10810  14122  13289  24161  16648
7  음식물류발생량  일일(톤)     14     24     18  ...     30     39     36     66     46

[8 rows x 18 columns]

In [82]:
df.columns = [item.strip() for item in df.columns]
df.columns

Index(['항목', '구분', '중구', '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구',
       '사하구', '금정구', '강서구', '연제구', '수영구', '사상구', '기장군'],
      dtype='object')

####**N행 확인하기**
+ .head(N) 
  - 데이터프레임의 상위 N개의 행을 출력
  - N생략하면 5개 
+ .tail(N)  
 - 하위 N개의 행을 출력

In [83]:
df.head()

       항목     구분     중구     서구     동구  ...    강서구    연제구    수영구    사상구    기장군
0   매립처리량  연간(톤)   3034   2323   1653  ...   9742   1831   2205   9937   2290
1   매립처리량  일일(톤)      8      7      5  ...     27      5      6     27      6
2   소각처리량  연간(톤)  13729  10446   8297  ...   4788  14521  11987    216  13687
3   소각처리량  일일(톤)     38     29     23  ...     13     40     33      0     37
4  재활용처리량  연간(톤)   9082  21301  17968  ...  25977  37115  28135  57110  15170

[5 rows x 18 columns]

In [84]:
df.head(2)

      항목     구분    중구    서구    동구   영도구  ...   금정구   강서구   연제구   수영구   사상구   기장군
0  매립처리량  연간(톤)  3034  2323  1653  1219  ...  7240  9742  1831  2205  9937  2290
1  매립처리량  일일(톤)     8     7     5     3  ...    20    27     5     6    27     6

[2 rows x 18 columns]

In [85]:
df.tail(2)

        항목     구분    중구    서구    동구  ...    강서구    연제구    수영구    사상구    기장군
6  음식물류발생량  연간(톤)  5154  8779  6399  ...  10810  14122  13289  24161  16648
7  음식물류발생량  일일(톤)    14    24    18  ...     30     39     36     66     46

[2 rows x 18 columns]

####**정보 확인하기**
+ .shape 속성
 - (행, 열) 크기를 확인하기
 - 행의 개수 : len(데이터프레임), len(.index), .shape[0]
 - 열의 개수 : len(.column), .shape[1]

In [86]:
df.shape

(8, 18)

In [87]:
#행의 개수
print(df.shape[0])
print(len(df))
print(len(df.index))

8
8
8

In [88]:
#열의 개수
print(df.shape[1]) 
print(len(df.columns))

18
18

+ .info()
 - 데이터프레임에 대한 전반적인 정보
 - 데이터프레임을 구성하는 행과 열의 크기, 컬럼명, 컬럼을 구성하는 값의 자료형 등을 출력

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 18 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   항목      8 non-null      object
 1   구분      8 non-null      object
 2   중구      8 non-null      int64
 3   서구      8 non-null      int64
 4   동구      8 non-null      int64
 5   영도구     8 non-null      int64
 6   부산진구    8 non-null      int64
 7   동래구     8 non-null      int64
 8   남구      8 non-null      int64
 9   북구      8 non-null      int64
 10  해운대구    8 non-null      int64
 11  사하구     8 non-null      int64
 12  금정구     8 non-null      int64
 13  강서구     8 non-null      int64
 14  연제구     8 non-null      int64
 15  수영구     8 non-null      int64
 16  사상구     8 non-null      int64
 17  기장군     8 non-null      int64
dtypes: int64(16), object(2)
memory usage: 1.2+ KB

+ .count()
 - Null이 아닌 행의 개수 확인
 - axis='columns' : Null이 아닌 열의 개수 확인

In [90]:
df.count()

항목      8
구분      8
중구      8
서구      8
동구      8
영도구     8
부산진구    8
동래구     8
남구      8
북구      8
해운대구    8
사하구     8
금정구     8
강서구     8
연제구     8
수영구     8
사상구     8
기장군     8
dtype: int64

In [91]:
df.count(axis='columns')

0    18
1    18
2    18
3    18
4    18
5    18
6    18
7    18
dtype: int64

####**값이 나온 횟수**
+ .value_counts() 
 - 개별 컬럼 내에 각각의 값이 나온 횟수
 - normalize 옵션 : % 로도 표현

In [92]:
df['구분'].value_counts()

일일(톤)    4
연간(톤)    4
Name: 구분, dtype: int64

In [93]:
df['구분'].value_counts(normalize = True)

일일(톤)    0.5
연간(톤)    0.5
Name: 구분, dtype: float64

####**요약 통계량 확인**
+ .describe()
 - 데이터프레임의 열별 요약 통계량
 - sum(),mean(), max(), median()등 개별 함수를 사용가능

In [94]:
df.sum()

항목      매립처리량매립처리량소각처리량소각처리량재활용처리량재활용처리량음식물류발생량음식물류발생량
구분            연간(톤)일일(톤)연간(톤)일일(톤)연간(톤)일일(톤)연간(톤)일일(톤)
중구                                               31084
서구                                               42967
동구                                               34412
영도구                                              44129
부산진구                                            133869
동래구                                              86101
남구                                               81893
북구                                               98945
해운대구                                            142273
사하구                                             128215
금정구                                              85121
강서구                                              51458
연제구                                              67775
수영구                                              55768
사상구                                              91673
기장군                                              47926
dtype: object

In [95]:
df.mean()

중구       3885.500
서구       5370.875
동구       4301.500
영도구      5516.125
부산진구    16733.625
동래구     10762.625
남구      10236.625
북구      12368.125
해운대구    17784.125
사하구     16026.875
금정구     10640.125
강서구      6432.250
연제구      8471.875
수영구      6971.000
사상구     11459.125
기장군      5990.750
dtype: float64

In [96]:
df.mean(axis=1)

0     5933.8750
1       16.2500
2     9496.8125
3       26.0000
4    43437.2500
5      119.0000
6    17398.6875
7       47.6875
dtype: float64

In [97]:
dfyear = df[df['구분'] == '연간(톤)']
dfyear

        항목     구분     중구     서구     동구  ...    강서구    연제구    수영구    사상구    기장군
0    매립처리량  연간(톤)   3034   2323   1653  ...   9742   1831   2205   9937   2290
2    소각처리량  연간(톤)  13729  10446   8297  ...   4788  14521  11987    216  13687
4   재활용처리량  연간(톤)   9082  21301  17968  ...  25977  37115  28135  57110  15170
6  음식물류발생량  연간(톤)   5154   8779   6399  ...  10810  14122  13289  24161  16648

[4 rows x 18 columns]

In [98]:
dfyear.describe()

                 중구            서구  ...           사상구           기장군
count      4.000000      4.000000  ...      4.000000      4.000000
mean    7749.750000  10712.250000  ...  22856.000000  11948.750000
std     4708.238763   7880.555961  ...  24863.022758   6551.650346
min     3034.000000   2323.000000  ...    216.000000   2290.000000
25%     4624.000000   7165.000000  ...   7506.750000  10837.750000
50%     7118.000000   9612.500000  ...  17049.000000  14428.500000
75%    10243.750000  13159.750000  ...  32398.250000  15539.500000
max    13729.000000  21301.000000  ...  57110.000000  16648.000000

[8 rows x 16 columns]

####**시리즈 내에 유일한 값 확인**
+ .unique() 
 - 개별 컬럼 내에 유일한 값을 확인

In [99]:
df['구분'].unique()

array(['연간(톤)', '일일(톤)'], dtype=object)

In [100]:
df['금정구'].unique()

array([ 7240,    20,   222,     1, 56153,   154, 21273,    58])

## **데이터프레임 슬라이싱**
+ .loc[행인덱싱, 열인덱싱]
+ .iloc[행순서번호, 열순서번호]

In [101]:
df2 = df.set_index('항목')
df2

            구분     중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                          ...
매립처리량    연간(톤)   3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량    일일(톤)      8      7      5      3  ...     27      5      6     27      6
소각처리량    연간(톤)  13729  10446   8297   8651  ...   4788  14521  11987    216  13687
소각처리량    일일(톤)     38     29     23     24  ...     13     40     33      0     37
재활용처리량   연간(톤)   9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량   일일(톤)     25     58     49     68  ...     71    102     77    156     42
음식물류발생량  연간(톤)   5154   8779   6399   9522  ...  10810  14122  13289  24161  16648
음식물류발생량  일일(톤)     14     24     18     26  ...     30     39     36     66     46

[8 rows x 17 columns]

#### **.loc : 인덱싱으로 추출**

In [102]:
#행추출
df2.loc['매립처리량']

          구분    중구    서구    동구   영도구   부산진구  ...   금정구   강서구   연제구   수영구   사상구   기장군
항목                                           ...
매립처리량  연간(톤)  3034  2323  1653  1219  17393  ...  7240  9742  1831  2205  9937  2290
매립처리량  일일(톤)     8     7     5     3     48  ...    20    27     5     6    27     6

[2 rows x 17 columns]

In [103]:
df2.loc[['매립처리량','재활용처리량']]

           구분    중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                        ...
매립처리량   연간(톤)  3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량   일일(톤)     8      7      5      3  ...     27      5      6     27      6
재활용처리량  연간(톤)  9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량  일일(톤)    25     58     49     68  ...     71    102     77    156     42

[4 rows x 17 columns]

In [104]:
#열추출
df2.loc[:, '금정구']

항목
매립처리량       7240
매립처리량         20
소각처리량        222
소각처리량          1
재활용처리량     56153
재활용처리량       154
음식물류발생량    21273
음식물류발생량       58
Name: 금정구, dtype: int64

In [105]:
df2.loc[:, ['구분','금정구']]

            구분    금정구
항목
매립처리량    연간(톤)   7240
매립처리량    일일(톤)     20
소각처리량    연간(톤)    222
소각처리량    일일(톤)      1
재활용처리량   연간(톤)  56153
재활용처리량   일일(톤)    154
음식물류발생량  연간(톤)  21273
음식물류발생량  일일(톤)     58

In [106]:
df2.loc[['매립처리량','재활용처리량'], ['구분','금정구']]

           구분    금정구
항목
매립처리량   연간(톤)   7240
매립처리량   일일(톤)     20
재활용처리량  연간(톤)  56153
재활용처리량  일일(톤)    154

#### **.iloc : 순서번호로 추출**

In [107]:
#행추출
df2.iloc[:2]

          구분    중구    서구    동구   영도구   부산진구  ...   금정구   강서구   연제구   수영구   사상구   기장군
항목                                           ...
매립처리량  연간(톤)  3034  2323  1653  1219  17393  ...  7240  9742  1831  2205  9937  2290
매립처리량  일일(톤)     8     7     5     3     48  ...    20    27     5     6    27     6

[2 rows x 17 columns]

In [108]:
df2.iloc[[0,1,4,5]]

           구분    중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                        ...
매립처리량   연간(톤)  3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량   일일(톤)     8      7      5      3  ...     27      5      6     27      6
재활용처리량  연간(톤)  9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량  일일(톤)    25     58     49     68  ...     71    102     77    156     42

[4 rows x 17 columns]

In [109]:
df2.iloc[[0:2]]

SyntaxError: ignored

In [110]:
df2.iloc[[0,2]]

          구분     중구     서구    동구   영도구  ...   강서구    연제구    수영구   사상구    기장군
항목                                      ...
매립처리량  연간(톤)   3034   2323  1653  1219  ...  9742   1831   2205  9937   2290
소각처리량  연간(톤)  13729  10446  8297  8651  ...  4788  14521  11987   216  13687

[2 rows x 17 columns]

In [111]:
#열추출
df2.iloc[:, 11]

항목
매립처리량       7240
매립처리량         20
소각처리량        222
소각처리량          1
재활용처리량     56153
재활용처리량       154
음식물류발생량    21273
음식물류발생량       58
Name: 금정구, dtype: int64

In [112]:
df2.iloc[:, [0,11]]

            구분    금정구
항목
매립처리량    연간(톤)   7240
매립처리량    일일(톤)     20
소각처리량    연간(톤)    222
소각처리량    일일(톤)      1
재활용처리량   연간(톤)  56153
재활용처리량   일일(톤)    154
음식물류발생량  연간(톤)  21273
음식물류발생량  일일(톤)     58

In [131]:
df21 = df2.iloc[[0,1,4,5], [0,11]]
df21

           구분    금정구
항목
매립처리량   연간(톤)   7240
매립처리량   일일(톤)     20
재활용처리량  연간(톤)  56153
재활용처리량  일일(톤)    154

#### 행열 전환 
+ 데이터프레임.T

In [132]:
df21 = df21.T

In [133]:
df21

항목   매립처리량  매립처리량 재활용처리량 재활용처리량
구분   연간(톤)  일일(톤)  연간(톤)  일일(톤)
금정구   7240     20  56153    154

In [134]:
df21.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 구분 to 금정구
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   매립처리량   2 non-null      object
 1   매립처리량   2 non-null      object
 2   재활용처리량  2 non-null      object
 3   재활용처리량  2 non-null      object
dtypes: object(4)
memory usage: 160.0+ bytes

#### 특정 인덱스 명 변경 
+ 인덱스 변경
 - 데이터프레임.rename(index = {'Old Name': 'New Name'})
+ 컬럼명 변경
 - 데이터프레임.rename(columns = {'Old Name': 'New Name'})

In [135]:
df21.index

Index(['구분', '금정구'], dtype='object')

In [137]:
df21 = df21.rename(index={'구분':'구분(톤)'})
df21

항목     매립처리량  매립처리량 재활용처리량 재활용처리량
구분(톤)  연간(톤)  일일(톤)  연간(톤)  일일(톤)
금정구     7240     20  56153    154

In [136]:
df21.columns

Index(['매립처리량', '매립처리량', '재활용처리량', '재활용처리량'], dtype='object', name='항목')

In [138]:
df21 = df21.rename(columns={'매립처리량':'매립'})
df21

항목        매립     매립 재활용처리량 재활용처리량
구분(톤)  연간(톤)  일일(톤)  연간(톤)  일일(톤)
금정구     7240     20  56153    154

In [141]:
df21.columns = df21.columns.str.replace('처리량', '')
df21

항목        매립     매립    재활용    재활용
구분(톤)  연간(톤)  일일(톤)  연간(톤)  일일(톤)
금정구     7240     20  56153    154



---
해결문제) 부산시기온.csv파일을 읽어서 2018년 최고, 최저 기온을 추출하고 통계량을 표시하시오.


---

In [ ]:
dfbusan = pd.read_csv('/content/drive/My Drive/PythonWork/PythonBasic/04/부산시기온.csv',engine='python')
dfbusan

            일시    평균    최고    최저
0   2017-01-01   4.1  15.1  -7.7
1   2017-02-01   5.5  17.7  -5.7
2   2017-03-01   9.0  18.1  -2.3
3   2017-04-01  15.0  23.2   5.0
4   2017-05-01  19.0  28.2  12.8
5   2017-06-01  21.3  30.4  15.4
6   2017-07-01  26.1  32.7  21.2
7   2017-08-01  27.0  36.2  18.7
8   2017-09-01  22.6  29.7  14.5
9   2017-10-01  18.1  28.7   7.3
10  2017-11-01  11.2  23.6  -1.0
11  2017-12-01   3.6  14.5  -6.1
12  2018-01-01   1.9  14.0  -9.9
13  2018-02-01   3.9  14.7  -9.6
14  2018-03-01  10.0  22.3  -0.7
15  2018-04-01  14.5  24.3   3.0
16  2018-05-01  17.8  26.6   9.8
17  2018-06-01  21.5  31.3  15.1
18  2018-07-01  26.7  35.4  17.8
19  2018-08-01  27.9  36.4  21.2
20  2018-09-01  21.9  30.0  14.9
21  2018-10-01  16.4  25.6   7.9
22  2018-11-01  12.4  22.5   2.7
23  2018-12-01   5.7  18.8  -7.1
24  2019-01-01   4.5  13.7  -4.4
25  2019-02-01   6.6  16.5  -4.2
26  2019-03-01  10.5  21.0   0.5
27  2019-04-01  13.4  23.4   2.1
28  2019-05-01  19.3  30.1  11.0
29  2019-06-01  21.1  29.7  15.5

In [ ]:
dfbusan.columns

Index(['일시', '평균', '최고', '최저'], dtype='object')

In [ ]:
dfbusan = dfbusan.loc[12:23, ['일시','최고','최저']]
dfbusan

            일시    최고    최저
12  2018-01-01  14.0  -9.9
13  2018-02-01  14.7  -9.6
14  2018-03-01  22.3  -0.7
15  2018-04-01  24.3   3.0
16  2018-05-01  26.6   9.8
17  2018-06-01  31.3  15.1
18  2018-07-01  35.4  17.8
19  2018-08-01  36.4  21.2
20  2018-09-01  30.0  14.9
21  2018-10-01  25.6   7.9
22  2018-11-01  22.5   2.7
23  2018-12-01  18.8  -7.1

In [ ]:
dfbusan.describe()

              최고         최저
count  12.000000  12.000000
mean   25.158333   5.425000
std     7.292519  10.782741
min    14.000000  -9.900000
25%    21.425000  -2.300000
50%    24.950000   5.450000
75%    30.325000  14.950000
max    36.400000  21.200000

#### 데이터 유형 확인 
+ 데이터프레임.dtypes : 각열의 유형을 알려줌

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 18 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   항목      8 non-null      object
 1   구분      8 non-null      object
 2   중구      8 non-null      int64
 3   서구      8 non-null      int64
 4   동구      8 non-null      int64
 5   영도구     8 non-null      int64
 6   부산진구    8 non-null      int64
 7   동래구     8 non-null      int64
 8   남구      8 non-null      int64
 9   북구      8 non-null      int64
 10  해운대구    8 non-null      int64
 11  사하구     8 non-null      int64
 12  금정구     8 non-null      int64
 13  강서구     8 non-null      int64
 14  연제구     8 non-null      int64
 15  수영구     8 non-null      int64
 16  사상구     8 non-null      int64
 17  기장군     8 non-null      int64
dtypes: int64(16), object(2)
memory usage: 1.2+ KB

In [ ]:
df.dtypes

항목      object
구분      object
중구       int64
서구       int64
동구       int64
영도구      int64
부산진구     int64
동래구      int64
남구       int64
북구       int64
해운대구     int64
사하구      int64
금정구      int64
강서구      int64
연제구      int64
수영구      int64
사상구      int64
기장군      int64
dtype: object

+ 열시리즈.astype() : 특정 유형으로 변경
 - .astype(float64) , .astype(float32) , .astype(float16), .astype(int)
 - .astype(str)

In [ ]:
df = dfbusan

In [ ]:
df['차이'] = df['최고'] - df['최저']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 12 to 23
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      12 non-null     object
 1   최고      12 non-null     float64
 2   최저      12 non-null     float64
 3   차이      12 non-null     float64
dtypes: float64(3), object(1)
memory usage: 516.0+ bytes

In [ ]:
df['차이'] = df['차이'].astype(int)
df.dtypes

일시     object
최고    float64
최저    float64
차이      int64
dtype: object

In [ ]:
df.head(2)

            일시    최고   최저  차이
12  2018-01-01  14.0 -9.9  23
13  2018-02-01  14.7 -9.6  24

+ pd.to_numeric() : 숫자 유형으로 변경
 - errors 매개 변수 
 - errors='ignore' : 무시
 - errors='coerce' : NaN

In [ ]:
lt = ['1','2','a']
df2 = pd.DataFrame(lt)
df2.columns = ['자료']
df2

  자료
0  1
1  2
2  a

In [ ]:
df2.dtypes

자료    object
dtype: object

In [ ]:
df2['자료'] = pd.to_numeric(df2['자료'])
df2.dtypes

ValueError: ignored

In [ ]:
df2['자료'] = pd.to_numeric(df2['자료'], errors='ignore')
df2

  자료
0  1
1  2
2  a

In [ ]:
df2.dtypes

자료    object
dtype: object

In [ ]:
df2['자료'] = pd.to_numeric(df2['자료'], errors='coerce' )
df2

    자료
0  1.0
1  2.0
2  NaN

In [ ]:
df2.dtypes

자료    float64
dtype: object

+ pd.to_datetime(열명)
 - .dt.year : 년도
 - .dt.month : 월
 - .dt.day : 일

참고 ) Accessors(접근자) : dtype 관련 메소드로 Series 내에서 특정 데이터 형식에만 적용되는 별도의 네임 스페이스

[참고사이트](https://pandas.pydata.org/pandas-docs/stable/reference/series.html#time-series-related)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 12 to 23
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      12 non-null     datetime64[ns]
 1   최고      12 non-null     float64
 2   최저      12 non-null     float64
 3   차이      12 non-null     int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 516.0 bytes

In [ ]:
df['일시'] = pd.to_datetime(df['일시'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 12 to 23
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      12 non-null     datetime64[ns]
 1   최고      12 non-null     float64
 2   최저      12 non-null     float64
 3   차이      12 non-null     int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 516.0 bytes

In [ ]:
df['일시'].dt.year

12    2018
13    2018
14    2018
15    2018
16    2018
17    2018
18    2018
19    2018
20    2018
21    2018
22    2018
23    2018
Name: 일시, dtype: int64

####**열 추가**

In [ ]:
dfbusan['년도'] = dfbusan['일시'].dt.year
dfbusan['월'] = dfbusan['일시'].dt.month
dfbusan['일'] = dfbusan['일시'].dt.day
dfbusan

           일시    최고    최저  차이    년도   월  일
12 2018-01-01  14.0  -9.9  23  2018   1  1
13 2018-02-01  14.7  -9.6  24  2018   2  1
14 2018-03-01  22.3  -0.7  23  2018   3  1
15 2018-04-01  24.3   3.0  21  2018   4  1
16 2018-05-01  26.6   9.8  16  2018   5  1
17 2018-06-01  31.3  15.1  16  2018   6  1
18 2018-07-01  35.4  17.8  17  2018   7  1
19 2018-08-01  36.4  21.2  15  2018   8  1
20 2018-09-01  30.0  14.9  15  2018   9  1
21 2018-10-01  25.6   7.9  17  2018  10  1
22 2018-11-01  22.5   2.7  19  2018  11  1
23 2018-12-01  18.8  -7.1  25  2018  12  1

In [ ]:
dfbusan['평균'] = dfbusan[['최고','최저']].mean(axis=1)
dfbusan

           일시    최고    최저  차이    년도   월  일     평균
12 2018-01-01  14.0  -9.9  23  2018   1  1   2.05
13 2018-02-01  14.7  -9.6  24  2018   2  1   2.55
14 2018-03-01  22.3  -0.7  23  2018   3  1  10.80
15 2018-04-01  24.3   3.0  21  2018   4  1  13.65
16 2018-05-01  26.6   9.8  16  2018   5  1  18.20
17 2018-06-01  31.3  15.1  16  2018   6  1  23.20
18 2018-07-01  35.4  17.8  17  2018   7  1  26.60
19 2018-08-01  36.4  21.2  15  2018   8  1  28.80
20 2018-09-01  30.0  14.9  15  2018   9  1  22.45
21 2018-10-01  25.6   7.9  17  2018  10  1  16.75
22 2018-11-01  22.5   2.7  19  2018  11  1  12.60
23 2018-12-01  18.8  -7.1  25  2018  12  1   5.85

####**행 추가**

In [ ]:
df.dtypes

일시    datetime64[ns]
최고           float64
최저           float64
차이             int64
년도             int64
월              int64
일              int64
평균           float64
dtype: object

In [ ]:
df['일시'] = df['일시'].astype(str)
df.dtypes

일시     object
최고    float64
최저    float64
차이      int64
년도      int64
월       int64
일       int64
평균    float64
dtype: object

In [ ]:
df = df.set_index('일시')
df

              최고    최저  차이    년도   월  일     평균
일시
2018-01-01  14.0  -9.9  23  2018   1  1   2.05
2018-02-01  14.7  -9.6  24  2018   2  1   2.55
2018-03-01  22.3  -0.7  23  2018   3  1  10.80
2018-04-01  24.3   3.0  21  2018   4  1  13.65
2018-05-01  26.6   9.8  16  2018   5  1  18.20
2018-06-01  31.3  15.1  16  2018   6  1  23.20
2018-07-01  35.4  17.8  17  2018   7  1  26.60
2018-08-01  36.4  21.2  15  2018   8  1  28.80
2018-09-01  30.0  14.9  15  2018   9  1  22.45
2018-10-01  25.6   7.9  17  2018  10  1  16.75
2018-11-01  22.5   2.7  19  2018  11  1  12.60
2018-12-01  18.8  -7.1  25  2018  12  1   5.85

In [ ]:
df.loc['평균'] = df.mean()
df

                   최고      최저     차이      년도     월    일         평균
일시
2018-01-01  14.000000  -9.900  23.00  2018.0   1.0  1.0   2.050000
2018-02-01  14.700000  -9.600  24.00  2018.0   2.0  1.0   2.550000
2018-03-01  22.300000  -0.700  23.00  2018.0   3.0  1.0  10.800000
2018-04-01  24.300000   3.000  21.00  2018.0   4.0  1.0  13.650000
2018-05-01  26.600000   9.800  16.00  2018.0   5.0  1.0  18.200000
2018-06-01  31.300000  15.100  16.00  2018.0   6.0  1.0  23.200000
2018-07-01  35.400000  17.800  17.00  2018.0   7.0  1.0  26.600000
2018-08-01  36.400000  21.200  15.00  2018.0   8.0  1.0  28.800000
2018-09-01  30.000000  14.900  15.00  2018.0   9.0  1.0  22.450000
2018-10-01  25.600000   7.900  17.00  2018.0  10.0  1.0  16.750000
2018-11-01  22.500000   2.700  19.00  2018.0  11.0  1.0  12.600000
2018-12-01  18.800000  -7.100  25.00  2018.0  12.0  1.0   5.850000
평균          25.158333   5.425  19.25  2018.0   6.5  1.0  15.291667

#### 행열 삭제
+ .drop(행인덱스, axis=0)
+ .drop(열인덱스, axis=1)

In [ ]:
df = df.drop(['월','일'], axis=1)
df

                   최고      최저     차이      년도         평균
일시
2018-01-01  14.000000  -9.900  23.00  2018.0   2.050000
2018-02-01  14.700000  -9.600  24.00  2018.0   2.550000
2018-03-01  22.300000  -0.700  23.00  2018.0  10.800000
2018-04-01  24.300000   3.000  21.00  2018.0  13.650000
2018-05-01  26.600000   9.800  16.00  2018.0  18.200000
2018-06-01  31.300000  15.100  16.00  2018.0  23.200000
2018-07-01  35.400000  17.800  17.00  2018.0  26.600000
2018-08-01  36.400000  21.200  15.00  2018.0  28.800000
2018-09-01  30.000000  14.900  15.00  2018.0  22.450000
2018-10-01  25.600000   7.900  17.00  2018.0  16.750000
2018-11-01  22.500000   2.700  19.00  2018.0  12.600000
2018-12-01  18.800000  -7.100  25.00  2018.0   5.850000
평균          25.158333   5.425  19.25  2018.0  15.291667

In [ ]:
df.loc['평균', ['차이', '년도']] = 0
df

                   최고      최저    차이      년도         평균
일시
2018-01-01  14.000000  -9.900  23.0  2018.0   2.050000
2018-02-01  14.700000  -9.600  24.0  2018.0   2.550000
2018-03-01  22.300000  -0.700  23.0  2018.0  10.800000
2018-04-01  24.300000   3.000  21.0  2018.0  13.650000
2018-05-01  26.600000   9.800  16.0  2018.0  18.200000
2018-06-01  31.300000  15.100  16.0  2018.0  23.200000
2018-07-01  35.400000  17.800  17.0  2018.0  26.600000
2018-08-01  36.400000  21.200  15.0  2018.0  28.800000
2018-09-01  30.000000  14.900  15.0  2018.0  22.450000
2018-10-01  25.600000   7.900  17.0  2018.0  16.750000
2018-11-01  22.500000   2.700  19.0  2018.0  12.600000
2018-12-01  18.800000  -7.100  25.0  2018.0   5.850000
평균          25.158333   5.425   0.0     0.0  15.291667

In [ ]:
df = df.drop('평균', axis=0)
df

              최고    최저    차이      년도
일시
2018-01-01  14.0  -9.9  23.0  2018.0
2018-02-01  14.7  -9.6  24.0  2018.0
2018-03-01  22.3  -0.7  23.0  2018.0
2018-04-01  24.3   3.0  21.0  2018.0
2018-05-01  26.6   9.8  16.0  2018.0
2018-06-01  31.3  15.1  16.0  2018.0
2018-07-01  35.4  17.8  17.0  2018.0
2018-08-01  36.4  21.2  15.0  2018.0
2018-09-01  30.0  14.9  15.0  2018.0
2018-10-01  25.6   7.9  17.0  2018.0
2018-11-01  22.5   2.7  19.0  2018.0
2018-12-01  18.8  -7.1  25.0  2018.0

#### 정렬하기
+ .sort_index()
 - 인덱스(index)를 기준으로 정렬
+ .sort_values()
 - 컬럼의 값을 기준으로 데이터를 정렬
 - 옵션 : by=컬럼 , ascending=False

In [ ]:
df = df.sort_values(by = '차이')
df

              최고    최저    차이      년도
일시
2018-08-01  36.4  21.2  15.0  2018.0
2018-09-01  30.0  14.9  15.0  2018.0
2018-05-01  26.6   9.8  16.0  2018.0
2018-06-01  31.3  15.1  16.0  2018.0
2018-07-01  35.4  17.8  17.0  2018.0
2018-10-01  25.6   7.9  17.0  2018.0
2018-11-01  22.5   2.7  19.0  2018.0
2018-04-01  24.3   3.0  21.0  2018.0
2018-01-01  14.0  -9.9  23.0  2018.0
2018-03-01  22.3  -0.7  23.0  2018.0
2018-02-01  14.7  -9.6  24.0  2018.0
2018-12-01  18.8  -7.1  25.0  2018.0

In [ ]:
df = df.sort_index()
df

              최고    최저    차이      년도
일시
2018-01-01  14.0  -9.9  23.0  2018.0
2018-02-01  14.7  -9.6  24.0  2018.0
2018-03-01  22.3  -0.7  23.0  2018.0
2018-04-01  24.3   3.0  21.0  2018.0
2018-05-01  26.6   9.8  16.0  2018.0
2018-06-01  31.3  15.1  16.0  2018.0
2018-07-01  35.4  17.8  17.0  2018.0
2018-08-01  36.4  21.2  15.0  2018.0
2018-09-01  30.0  14.9  15.0  2018.0
2018-10-01  25.6   7.9  17.0  2018.0
2018-11-01  22.5   2.7  19.0  2018.0
2018-12-01  18.8  -7.1  25.0  2018.0



---
해결문제) mv1.csv 파일을 읽어서 2019년 자료를 추출하여 평점 평균을 구하시오.


```
	        영화명	                 순위	  평점
일자			
2019-07-31	마이펫의 이중생활 2	        47	  7.900000
2019-06-19	롱 리브 더 킹: 목포 영웅	48    7.600000
2019-12-11	쥬만지: 넥스트 레벨	        49	  5.900000
2019-06-26	존 윅 3: 파라벨룸	        50	  6.900000
평균			                              7.48163
```



---

In [ ]:
dfmv = pd.read_csv('/content/drive/My Drive/PythonWork/PythonBasic/04/mv1.csv',names=['영화코드', '순위', '링크', '영화명', '평점', '일자'], header=None)
dfmv.head()

     영화코드  순위                             링크          영화명   평점           일자
0  119859   1   /moviedb/main?movieId=119859         극한직업  7.4   2019.01.23
1   93252   2    /moviedb/main?movieId=93252   어벤져스: 엔드게임  7.8   2019.04.24
2   93004   3    /moviedb/main?movieId=93004       겨울왕국 2  7.4   2019.11.21
3  115601   4   /moviedb/main?movieId=115601          알라딘  8.4   2019.05.23
4  111292   5   /moviedb/main?movieId=111292          기생충  7.9   2019.05.30

In [ ]:
df = dfmv[['일자','영화명','순위', '평점']]
df.head()

            일자          영화명  순위   평점
0   2019.01.23         극한직업   1  7.4
1   2019.04.24   어벤져스: 엔드게임   2  7.8
2   2019.11.21       겨울왕국 2   3  7.4
3   2019.05.23          알라딘   4  8.4
4   2019.05.30          기생충   5  7.9

In [ ]:
df['일자'] = pd.to_datetime(df['일자'])
df.dtypes

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

일자     datetime64[ns]
영화명            object
순위              int64
평점            float64
dtype: object

In [ ]:
df2019 = df[df['일자'].dt.year == 2019]
df2019.head()

          일자          영화명  순위   평점
0 2019-01-23         극한직업   1  7.4
1 2019-04-24   어벤져스: 엔드게임   2  7.8
2 2019-11-21       겨울왕국 2   3  7.4
3 2019-05-23          알라딘   4  8.4
4 2019-05-30          기생충   5  7.9

In [ ]:
df2019['일자'] = df2019['일자'].astype(str)
df2019.dtypes

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

일자      object
영화명     object
순위       int64
평점     float64
dtype: object

In [ ]:
df2019 = df2019.set_index('일자')
df2019.head()

                    영화명  순위   평점
일자
2019-01-23         극한직업   1  7.4
2019-04-24   어벤져스: 엔드게임   2  7.8
2019-11-21       겨울왕국 2   3  7.4
2019-05-23          알라딘   4  8.4
2019-05-30          기생충   5  7.9

In [ ]:
df2019.loc['평균'] = df2019.mean(axis=0)
df2019

                           영화명         순위        평점
일자
2019-01-23                극한직업   1.000000  7.400000
2019-04-24          어벤져스: 엔드게임   2.000000  7.800000
2019-11-21              겨울왕국 2   3.000000  7.400000
2019-05-23                 알라딘   4.000000  8.400000
2019-05-30                 기생충   5.000000  7.900000
2019-07-31                 엑시트   6.000000  7.700000
2019-07-02       스파이더맨: 파 프롬 홈   7.000000  6.500000
2019-12-19                 백두산   8.000000  6.500000
2019-03-06               캡틴 마블   9.000000  6.300000
2019-10-02                  조커  10.000000  7.700000
2019-08-07              봉오동 전투  11.000000  8.800000
2019-07-17               라이온 킹  12.000000  7.400000
2019-09-11        나쁜 녀석들: 더 무비  13.000000  6.300000
2019-10-23            82년생 김지영  14.000000  6.700000
2019-08-14        분노의 질주: 홉스&쇼  15.000000  7.000000
2019-06-20            토이 스토리 4  16.000000  8.600000
2019-03-20                   돈  17.000000  6.700000
2019-05-15                 악인전  18.000000  7.400000
2019-10-02           가장 보통의 연애  19.000000  7.400000
2019-01-09                 말모이  20.000000  9.100000
2019-02-13                  증인  21.000000  9.300000
2019-12-18                  시동  22.000000  7.600000
2019-11-13                블랙머니  23.000000  9.100000
2019-10-30       터미네이터: 다크 페이트  24.000000  7.800000
2019-02-20                 사바하  25.000000  7.300000
2019-09-11         타짜: 원 아이드 잭  26.000000  5.200000
2019-11-07         신의 한 수: 귀수편  27.000000  6.800000
2019-02-05          알리타: 배틀 엔젤  28.000000  8.300000
2019-01-09              내안의 그놈  29.000000  7.800000
2019-01-30                  뺑반  30.000000  6.200000
2019-08-21                  변신  31.000000  7.500000
2019-01-03   주먹왕 랄프 2: 인터넷 속으로  32.000000  7.600000
2019-05-09                 걸캅스  33.000000  6.500000
2019-07-31                  사자  34.000000  6.900000
2019-01-30          드래곤 길들이기 3  36.000000  8.300000
2019-05-01           나의 특별한 형제  37.000000  8.600000
2019-03-27                  어스  38.000000  5.700000
2019-10-17             말레피센트 2  39.000000  7.500000
2019-08-28            유열의 음악앨범  40.000000  7.000000
2019-10-02                퍼펙트맨  41.000000  6.900000
2019-12-04            포드 V 페라리  42.000000  8.700000
2019-04-03                  생일  43.000000  8.600000
2019-09-11         힘을 내요 미스터 리  44.000000  7.700000
2019-02-27          항거:유관순 이야기  45.000000  9.000000
2019-09-25       장사리 : 잊혀진 영웅들  46.000000  7.400000
2019-07-31         마이펫의 이중생활 2  47.000000  7.900000
2019-06-19     롱 리브 더 킹: 목포 영웅  48.000000  7.600000
2019-12-11         쥬만지: 넥스트 레벨  49.000000  5.900000
2019-06-26         존 윅 3: 파라벨룸  50.000000  6.900000
평균                         NaN  25.306122  7.481633

In [ ]:
df2019.loc['평균', '영화명'] = ''
df2019.loc['평균', '순위'] = ''

df2019.tail()

                         영화명  순위        평점
일자
2019-07-31       마이펫의 이중생활 2  47  7.900000
2019-06-19   롱 리브 더 킹: 목포 영웅  48  7.600000
2019-12-11       쥬만지: 넥스트 레벨  49  5.900000
2019-06-26       존 윅 3: 파라벨룸  50  6.900000
평균                                7.481633